Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4SD32B.atdf
        <register caption="Interrupt Mask Register" name="ADC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="End of Conversion Interrupt Mask 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Mask 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Mask 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Mask 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Mask 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Mask 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Mask 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Mask 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Mask 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Mask 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Mask 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="End of Conversion Interrupt Mask 12" mask="0x00001000" name="EOC12"/>
          <bitfield caption="End of Conversion Interrupt Mask 13" mask="0x00002000" name="EOC13"/>
          <bitfield caption="End of Conversion Interrupt Mask 14" mask="0x00004000" name="EOC14"/>
          <bitfield caption="End of Conversion Interrupt Mask 15" mask="0x00008000" name="EOC15"/>
          <bitfield caption="End of Calibration Sequence" mask="0x00800000" name="EOCAL"/>
          <bitfield caption="Data Ready Interrupt Mask" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Mask" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Status Register" name="ADC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="End of Conversion 0 (automatically set / cleared)" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion 1 (automatically set / cleared)" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion 2 (automatically set / cleared)" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion 3 (automatically set / cleared)" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion 4 (automatically set / cleared)" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion 5 (automatically set / cleared)" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion 6 (automatically set / cleared)" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion 7 (automatically set / cleared)" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion 8 (automatically set / cleared)" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion 9 (automatically set / cleared)" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion 10 (automatically set / cleared)" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion 11 (automatically set / cleared)" mask="0x00000800" name="EOC11"/>
          <bitfield caption="End of Conversion 12 (automatically set / cleared)" mask="0x00001000" name="EOC12"/>
          <bitfield caption="End of Conversion 13 (automatically set / cleared)" mask="0x00002000" name="EOC13"/>
          <bitfield caption="End of Conversion 14 (automatically set / cleared)" mask="0x00004000" name="EOC14"/>
          <bitfield caption="End of Conversion 15 (automatically set / cleared)" mask="0x00008000" name="EOC15"/>
          <bitfield caption="End of Calibration Sequence" mask="0x00800000" name="EOCAL"/>
          <bitfield caption="Data Ready (automatically set / cleared)" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error (cleared on read)" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event (cleared on read)" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR)" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR)" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Overrun Status Register" name="ADC_OVER" offset="0x3C" rw="R" size="4">
          <bitfield caption="Overrun Error 0" mask="0x00000001" name="OVRE0"/>
          <bitfield caption="Overrun Error 1" mask="0x00000002" name="OVRE1"/>
          <bitfield caption="Overrun Error 2" mask="0x00000004" name="OVRE2"/>
          <bitfield caption="Overrun Error 3" mask="0x00000008" name="OVRE3"/>
          <bitfield caption="Overrun Error 4" mask="0x00000010" name="OVRE4"/>
          <bitfield caption="Overrun Error 5" mask="0x00000020" name="OVRE5"/>
          <bitfield caption="Overrun Error 6" mask="0x00000040" name="OVRE6"/>
          <bitfield caption="Overrun Error 7" mask="0x00000080" name="OVRE7"/>
          <bitfield caption="Overrun Error 8" mask="0x00000100" name="OVRE8"/>
          <bitfield caption="Overrun Error 9" mask="0x00000200" name="OVRE9"/>
          <bitfield caption="Overrun Error 10" mask="0x00000400" name="OVRE10"/>
          <bitfield caption="Overrun Error 11" mask="0x00000800" name="OVRE11"/>
          <bitfield caption="Overrun Error 12" mask="0x00001000" name="OVRE12"/>
          <bitfield caption="Overrun Error 13" mask="0x00002000" name="OVRE13"/>
          <bitfield caption="Overrun Error 14" mask="0x00004000" name="OVRE14"/>
          <bitfield caption="Overrun Error 15" mask="0x00008000" name="OVRE15"/>
        </register>
        <register caption="Extended Mode Register" name="ADC_EMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Comparison Mode" mask="0x00000003" name="CMPMODE" values="ADC_EMR__CMPMODE"/>
          <bitfield caption="Comparison Selected Channel" mask="0x000000F0" name="CMPSEL"/>
          <bitfield caption="Compare All Channels" mask="0x00000200" name="CMPALL"/>
          <bitfield caption="Tag of the ADC_LCDR" mask="0x01000000" name="TAG"/>
        </register>
        <register caption="Compare Window Register" name="ADC_CWR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Low Threshold" mask="0x00000FFF" name="LOWTHRES"/>
          <bitfield caption="High Threshold" mask="0x0FFF0000" name="HIGHTHRES"/>
        </register>
        <register caption="Channel Gain Register" name="ADC_CGR" offset="0x48" rw="RW" size="4">
          <bitfield caption="Gain for Channel 0" mask="0x00000003" name="GAIN0" values="ADC_CGR__GAIN0"/>
          <bitfield caption="Gain for Channel 1" mask="0x0000000C" name="GAIN1" values="ADC_CGR__GAIN1"/>
          <bitfield caption="Gain for Channel 2" mask="0x00000030" name="GAIN2" values="ADC_CGR__GAIN2"/>
          <bitfield caption="Gain for Channel 3" mask="0x000000C0" name="GAIN3" values="ADC_CGR__GAIN3"/>
          <bitfield caption="Gain for Channel 4" mask="0x00000300" name="GAIN4" values="ADC_CGR__GAIN4"/>
          <bitfield caption="Gain for Channel 5" mask="0x00000C00" name="GAIN5" values="ADC_CGR__GAIN5"/>
          <bitfield caption="Gain for Channel 6" mask="0x00003000" name="GAIN6" values="ADC_CGR__GAIN6"/>
          <bitfield caption="Gain for Channel 7" mask="0x0000C000" name="GAIN7" values="ADC_CGR__GAIN7"/>
          <bitfield caption="Gain for Channel 8" mask="0x00030000" name="GAIN8" values="ADC_CGR__GAIN8"/>
          <bitfield caption="Gain for Channel 9" mask="0x000C0000" name="GAIN9" values="ADC_CGR__GAIN9"/>
          <bitfield caption="Gain for Channel 10" mask="0x00300000" name="GAIN10" values="ADC_CGR__GAIN10"/>
          <bitfield caption="Gain for Channel 11" mask="0x00C00000" name="GAIN11" values="ADC_CGR__GAIN11"/>
          <bitfield caption="Gain for Channel 12" mask="0x03000000" name="GAIN12" values="ADC_CGR__GAIN12"/>
          <bitfield caption="Gain for Channel 13" mask="0x0C000000" name="GAIN13" values="ADC_CGR__GAIN13"/>
          <bitfield caption="Gain for Channel 14" mask="0x30000000" name="GAIN14" values="ADC_CGR__GAIN14"/>
          <bitfield caption="Gain for Channel 15" mask="0xC0000000" name="GAIN15" values="ADC_CGR__GAIN15"/>
        </register>
        <register caption="Channel Offset Register" name="ADC_COR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Offset for Channel 0" mask="0x00000001" name="OFF0"/>
          <bitfield caption="Offset for Channel 1" mask="0x00000002" name="OFF1"/>
          <bitfield caption="Offset for Channel 2" mask="0x00000004" name="OFF2"/>
          <bitfield caption="Offset for Channel 3" mask="0x00000008" name="OFF3"/>
          <bitfield caption="Offset for Channel 4" mask="0x00000010" name="OFF4"/>
          <bitfield caption="Offset for Channel 5" mask="0x00000020" name="OFF5"/>
          <bitfield caption="Offset for Channel 6" mask="0x00000040" name="OFF6"/>
          <bitfield caption="Offset for Channel 7" mask="0x00000080" name="OFF7"/>
          <bitfield caption="Offset for Channel 8" mask="0x00000100" name="OFF8"/>
          <bitfield caption="Offset for Channel 9" mask="0x00000200" name="OFF9"/>
          <bitfield caption="Offset for Channel 10" mask="0x00000400" name="OFF10"/>
          <bitfield caption="Offset for Channel 11" mask="0x00000800" name="OFF11"/>
          <bitfield caption="Offset for Channel 12" mask="0x00001000" name="OFF12"/>
          <bitfield caption="Offset for Channel 13" mask="0x00002000" name="OFF13"/>
          <bitfield caption="Offset for Channel 14" mask="0x00004000" name="OFF14"/>
          <bitfield caption="Offset for Channel 15" mask="0x00008000" name="OFF15"/>
          <bitfield caption="Differential Inputs for Channel 0" mask="0x00010000" name="DIFF0"/>
          <bitfield caption="Differential Inputs for Channel 1" mask="0x00020000" name="DIFF1"/>
          <bitfield caption="Differential Inputs for Channel 2" mask="0x00040000" name="DIFF2"/>
          <bitfield caption="Differential Inputs for Channel 3" mask="0x00080000" name="DIFF3"/>
          <bitfield caption="Differential Inputs for Channel 4" mask="0x00100000" name="DIFF4"/>
          <bitfield caption="Differential Inputs for Channel 5" mask="0x00200000" name="DIFF5"/>
          <bitfield caption="Differential Inputs for Channel 6" mask="0x00400000" name="DIFF6"/>
          <bitfield caption="Differential Inputs for Channel 7" mask="0x00800000" name="DIFF7"/>
          <bitfield caption="Differential Inputs for Channel 8" mask="0x01000000" name="DIFF8"/>
          <bitfield caption="Differential Inputs for Channel 9" mask="0x02000000" name="DIFF9"/>
          <bitfield caption="Differential Inputs for Channel 10" mask="0x04000000" name="DIFF10"/>
          <bitfield caption="Differential Inputs for Channel 11" mask="0x08000000" name="DIFF11"/>
          <bitfield caption="Differential Inputs for Channel 12" mask="0x10000000" name="DIFF12"/>
          <bitfield caption="Differential Inputs for Channel 13" mask="0x20000000" name="DIFF13"/>
          <bitfield caption="Differential Inputs for Channel 14" mask="0x40000000" name="DIFF14"/>
          <bitfield caption="Differential Inputs for Channel 15" mask="0x80000000" name="DIFF15"/>
        </register>
        <register caption="Channel Data Register 0" name="ADC_CDR0" offset="0x50" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 1" name="ADC_CDR1" offset="0x54" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 2" name="ADC_CDR2" offset="0x58" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 3" name="ADC_CDR3" offset="0x5C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 4" name="ADC_CDR4" offset="0x60" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
