Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4SD32B.atdf
        <register caption="Interrupt Mask Register" name="US_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Mask" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Mask" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Mask" mask="0x00000400" name="ITER"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non Acknowledge Interrupt Mask" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Mask" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Mask" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Interrupt Mask" mask="0x00040000" name="DCDIC"/>
          <bitfield caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Mask" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="Channel Status Register" name="US_CSR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready (cleared by reading US_RHR)" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing US_THR)" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of RX Buffer (cleared by writing US_RCR or US_RNCR)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of TX Buffer (cleared by writing US_TCR or US_TNCR)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000080" name="PARE"/>
          <bitfield caption="Receiver Time-out (cleared by writing a one to bit US_CR.STTTO)" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (cleared by writing US_THR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT)" mask="0x00000400" name="ITER"/>
          <bitfield caption="TX Buffer Empty (cleared by writing US_TCR or US_TNCR)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="RX Buffer Full (cleared by writing US_RCR or US_RNCR)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK)" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Flag (cleared on read)" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Flag (cleared on read)" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Flag (cleared on read)" mask="0x00040000" name="DCDIC"/>
          <bitfield caption="Clear to Send Input Change Flag (cleared on read)" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Image of RI Input" mask="0x00100000" name="RI"/>
          <bitfield caption="Image of DSR Input" mask="0x00200000" name="DSR"/>
          <bitfield caption="Image of DCD Input" mask="0x00400000" name="DCD"/>
          <bitfield caption="Image of CTS Input" mask="0x00800000" name="CTS"/>
          <bitfield caption="Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA)" mask="0x01000000" name="MANERR"/>
        </register>
        <register caption="Receive Holding Register" name="US_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000001FF" name="RXCHR"/>
          <bitfield caption="Received Sync" mask="0x00008000" name="RXSYNH"/>
        </register>
        <register caption="Transmit Holding Register" name="US_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" name="TXCHR"/>
          <bitfield caption="Sync Field to be Transmitted" mask="0x00008000" name="TXSYNH"/>
        </register>
        <register caption="Baud Rate Generator Register" name="US_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x0000FFFF" name="CD"/>
          <bitfield caption="Fractional Part" mask="0x00070000" name="FP"/>
        </register>
        <register caption="Receiver Time-out Register" name="US_RTOR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Time-out Value" mask="0x0000FFFF" name="TO"/>
        </register>
        <register caption="Transmitter Timeguard Register" name="US_TTGR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Timeguard Value" mask="0x000000FF" name="TG"/>
        </register>
        <register caption="FI DI Ratio Register" name="US_FIDI" offset="0x0040" rw="RW" size="4">
          <bitfield caption="FI Over DI Ratio Value" mask="0x000007FF" name="FI_DI_RATIO"/>
        </register>
        <register caption="Number of Errors Register" name="US_NER" offset="0x0044" rw="R" size="4">
          <bitfield caption="Number of Errors" mask="0x000000FF" name="NB_ERRORS"/>
        </register>
