Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4SD32B.atdf
            <value-group name="FORCED">
                <value value="0" name="VALUE_0" caption="no forced HardFault"/>
                <value value="1" name="VALUE_1" caption="forced HardFault"/>
            </value-group>
            <value-group name="HALTED">
                <value value="0" name="VALUE_0" caption="No active halt request debug event"/>
                <value value="1" name="VALUE_1" caption="Halt request debug event active"/>
            </value-group>
            <value-group name="BKPT">
                <value value="0" name="VALUE_0" caption="No current breakpoint debug event"/>
                <value value="1" name="VALUE_1" caption="At least one current breakpoint debug event"/>
            </value-group>
            <value-group name="DWTTRAP">
                <value value="0" name="VALUE_0" caption="No current debug events generated by the DWT"/>
                <value value="1" name="VALUE_1" caption="At least one current debug event generated by the DWT"/>
            </value-group>
            <value-group name="VCATCH">
                <value value="0" name="VALUE_0" caption="No Vector catch triggered"/>
                <value value="1" name="VALUE_1" caption="Vector catch triggered"/>
            </value-group>
            <value-group name="EXTERNAL">
                <value value="0" name="VALUE_0" caption="No EDBGRQ debug event"/>
                <value value="1" name="VALUE_1" caption="EDBGRQ debug event"/>
            </value-group>
        </module><module name="SysTick" caption="System timer">
            <register-group name="SysTick" caption="System timer">
                <register offset="0x00000000" size="4" name="CSR" initval="0x4" caption="SysTick Control and Status Register">
                    <bitfield mask="0x00000001" name="ENABLE" values="ENABLE" caption="no description available"/>
                    <bitfield mask="0x00000002" name="TICKINT" values="TICKINT" caption="no description available"/>
                    <bitfield mask="0x00000004" name="CLKSOURCE" values="CLKSOURCE" caption="no description available"/>
                    <bitfield mask="0x00010000" name="COUNTFLAG" caption="no description available"/>
                </register>
                <register offset="0x00000004" size="4" name="RVR" initval="0" caption="SysTick Reload Value Register">
                    <bitfield mask="0x00ffffff" name="RELOAD" caption="Value to load into the SysTick Current Value Register when the counter reaches 0"/>
                </register>
                <register offset="0x00000008" size="4" name="CVR" initval="0" caption="SysTick Current Value Register">
                    <bitfield mask="0x00ffffff" name="CURRENT" caption="Current value at the time the register is accessed"/>
                </register>
                <register offset="0x0000000c" size="4" name="CALIB" initval="0" caption="SysTick Calibration Value Register">
                    <bitfield mask="0x00ffffff" name="TENMS" caption="Reload value to use for 10ms timing"/>
                    <bitfield mask="0x40000000" name="SKEW" values="SKEW" caption="no description available"/>
                    <bitfield mask="0x80000000" name="NOREF" values="NOREF" caption="no description available"/>
                </register>
            </register-group>
            <value-group name="ENABLE">
                <value value="0" name="VALUE_0" caption="counter disabled"/>
                <value value="1" name="VALUE_1" caption="counter enabled"/>
            </value-group>
            <value-group name="TICKINT">
                <value value="0" name="VALUE_0" caption="counting down to 0 does not assert the SysTick exception request"/>
                <value value="1" name="VALUE_1" caption="counting down to 0 asserts the SysTick exception request"/>
            </value-group>
            <value-group name="CLKSOURCE">
                <value value="0" name="VALUE_0" caption="external clock"/>
                <value value="1" name="VALUE_1" caption="processor clock"/>
            </value-group>
            <value-group name="SKEW">
                <value value="0" name="VALUE_0" caption="10ms calibration value is exact"/>
                <value value="1" name="VALUE_1" caption="10ms calibration value is inexact, because of the clock frequency"/>
            </value-group>
            <value-group name="NOREF">
                <value value="0" name="VALUE_0" caption="The reference clock is provided"/>
                <value value="1" name="VALUE_1" caption="The reference clock is not provided"/>
            </value-group>
        </module><module name="NVIC" caption="Nested Vectored Interrupt Controller">
            <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
                <register offset="0x00000000" size="4" name="NVICISER0" initval="0" caption="Interrupt Set Enable Register n">
                    <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
                </register>
                <register offset="0x00000004" size="4" name="NVICISER1" initval="0" caption="Interrupt Set Enable Register n">
                    <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
                </register>
                <register offset="0x00000008" size="4" name="NVICISER2" initval="0" caption="Interrupt Set Enable Register n">
                    <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
                </register>
                <register offset="0x0000000c" size="4" name="NVICISER3" initval="0" caption="Interrupt Set Enable Register n">
                    <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
                </register>
                <register offset="0x00000080" size="4" name="NVICICER0" initval="0" caption="Interrupt Clear Enable Register n">
                    <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
                </register>
                <register offset="0x00000084" size="4" name="NVICICER1" initval="0" caption="Interrupt Clear Enable Register n">
                    <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
                </register>
                <register offset="0x00000088" size="4" name="NVICICER2" initval="0" caption="Interrupt Clear Enable Register n">
                    <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
                </register>
                <register offset="0x0000008c" size="4" name="NVICICER3" initval="0" caption="Interrupt Clear Enable Register n">
                    <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
                </register>
                <register offset="0x00000100" size="4" name="NVICISPR0" initval="0" caption="Interrupt Set Pending Register n">
                    <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
                </register>
